import image3 from "../../src/assets/images/courseImage1-coursesGrid.jpg";
import image2 from "../../src/assets/images/courseImage2-coursesGrid.jpg";
import image1 from "../../src/assets/images/courseImage3-coursesGrid.jpg";
import instructor1 from "../../src/assets/images/instructoer1.jpg";
import instructor2 from "../../src/assets/images/instructor2.jpg";
import reviewer1 from "../../src/assets/images/reviewer1.jpg";

export const dummyCourses = [
  {
    id: Math.random().toString(36).substr(2, 9),
    title: "كورس تصميم Ui UX للتطبيقات و المواقع الالكترونية.",
    description:
      "درس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام. يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة، مع تعريف الطالب بمبادئ التصميم الجيد وكيفية بناء تجربة بصرية مريحة وواضحة. يشمل الكورس تطبيقات عملية باستخدام أدوات احترافية مثل Figma وAdobe XD، ويتعلّم الطالب تصميم صفحات لتطبيقات الموبايل والمواقع بشكل احترافي. كما يتم شرح الأخطاء الشائعة في التصميم وكيفية تجنبها بأسلوب بسيط ومباشر. في نهاية الكورس، ينفّذ الطالب مشروع تصميم حقيقي ليضيفه إلى ملفه الشخصي (Portfolio)، ويحصل على تقييم وملاحظات تساعده على تحسين مستواه وتطوير مهاراته.",
    rating: 4.7,
    duration: "28 ساعة",
    studentsCount: 17000,
    img: image1, // تأكد من استيراد المتغير image1

    // 1. المميزات (Features)
    features: [
      { id: 1, text: "+ 170 طالبًا مشاركًا." },
      { id: 2, text: "شهادة بعد الانتهاء من الدورة." },
      { id: 3, text: "اختبارات بعد الانتهاء من كل درس." },
    ],
    // 2. قائمة الوحدات (Chapters)
    chapters: [
      {
        id: "ch1",
        title: "الوحدة الأولى : مقدمة في قواعد البيانات",
        description:
          "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام.يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ ",
      },
      {
        id: "ch2",
        title: "الوحدة الثانية : مقدمة في UI / UX",
        description:
          "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام.يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ ",
      },
      {
        id: "ch3",
        title: "الوحدة الثانية : مقدمة في UI / UX",
        description:
          "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام.يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ ",
      },
    ],

    // 3. مدربي الدورة (Instructors)
    instructors: [
      {
        id: "inst-1",
        name: "خليل شركة تيكنوفا",
        avatar: instructor1,
        coursesCount: 24,
        bio: "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام. يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ التصميم الجيد وكيفية بناء تجربة بصرية مريحة وواضحة.يشمل الكورس تطبيقات عملية باستخدام أدوات احترافية مثل Figma وAdobe ",
      },
      {
        id: "inst-2",
        name: "خليل شركة تيكنوفا",
        avatar: instructor2,
        coursesCount: 24,
        bio: "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام. يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ التصميم الجيد وكيفية بناء تجربة بصرية مريحة وواضحة.يشمل الكورس تطبيقات عملية باستخدام أدوات احترافية مثل Figma وAdobe ",
      },
    ],

    // 4. تعليقات الطلاب (Reviews)
    reviews: [
      {
        id: "rev-1",
        studentName: "محمد احمد الشيخ",
        avatar: reviewer1,
        accountType: "طالب",
        rating: 5,
        date: "2025/8/18",
        comment:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى التجربة التعليمية فيها حديثة وممتعة، فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
      },
      {
        id: "rev-2",
        studentName: "محمد احمد الشيخ",
        avatar: reviewer1,
        accountType: "طالب",
        rating: 5,
        date: "2025/8/18",
        comment:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى التجربة التعليمية فيها حديثة وممتعة، فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
      },
      {
        id: "rev-3",
        studentName: "محمد احمد الشيخ",
        avatar: reviewer1,
        accountType: "طالب",
        rating: 5,
        date: "2025/8/18",
        comment:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى التجربة التعليمية فيها حديثة وممتعة، فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
      },
    ],
  },
  {
    id: Math.random().toString(36).substr(2, 9),
    title: "كورس تصميم Ui UX للتطبيقات و المواقع الالكترونية.",
    description:
      "درس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام. يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة، مع تعريف الطالب بمبادئ التصميم الجيد وكيفية بناء تجربة بصرية مريحة وواضحة. يشمل الكورس تطبيقات عملية باستخدام أدوات احترافية مثل Figma وAdobe XD، ويتعلّم الطالب تصميم صفحات لتطبيقات الموبايل والمواقع بشكل احترافي. كما يتم شرح الأخطاء الشائعة في التصميم وكيفية تجنبها بأسلوب بسيط ومباشر. في نهاية الكورس، ينفّذ الطالب مشروع تصميم حقيقي ليضيفه إلى ملفه الشخصي (Portfolio)، ويحصل على تقييم وملاحظات تساعده على تحسين مستواه وتطوير مهاراته.",
    rating: 4.7,
    duration: "28 ساعة",
    studentsCount: 17000,
    img: image2, // تأكد من استيراد المتغير image1

    // 1. المميزات (Features)
    features: [
      { id: 1, text: "+ 170 طالبًا مشاركًا." },
      { id: 2, text: "شهادة بعد الانتهاء من الدورة." },
      { id: 3, text: "اختبارات بعد الانتهاء من كل درس." },
    ],
    // 2. قائمة الوحدات (Chapters)
    chapters: [
      {
        id: "ch1",
        title: "الوحدة الأولى : مقدمة في قواعد البيانات",
        description:
          "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام.يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ ",
      },
      {
        id: "ch2",
        title: "الوحدة الثانية : مقدمة في UI / UX",
        description:
          "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام.يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ ",
      },
      {
        id: "ch3",
        title: "الوحدة الثانية : مقدمة في UI / UX",
        description:
          "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام.يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ ",
      },
    ],

    // 3. مدربي الدورة (Instructors)
    instructors: [
      {
        id: "inst-1",
        name: "خليل شركة تيكنوفا",
        avatar: instructor1,
        coursesCount: 24,
        bio: "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام. يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ التصميم الجيد وكيفية بناء تجربة بصرية مريحة وواضحة.يشمل الكورس تطبيقات عملية باستخدام أدوات احترافية مثل Figma وAdobe ",
      },
      {
        id: "inst-2",
        name: "خليل شركة تيكنوفا",
        avatar: instructor2,
        coursesCount: 24,
        bio: "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام. يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ التصميم الجيد وكيفية بناء تجربة بصرية مريحة وواضحة.يشمل الكورس تطبيقات عملية باستخدام أدوات احترافية مثل Figma وAdobe ",
      },
    ],

    // 4. تعليقات الطلاب (Reviews)
    reviews: [
      {
        id: "rev-1",
        studentName: "محمد احمد الشيخ",
        avatar: reviewer1,
        accountType: "طالب",
        rating: 5,
        date: "2025/8/18",
        comment:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى التجربة التعليمية فيها حديثة وممتعة، فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
      },
      {
        id: "rev-2",
        studentName: "محمد احمد الشيخ",
        avatar: reviewer1,
        accountType: "طالب",
        rating: 5,
        date: "2025/8/18",
        comment:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى التجربة التعليمية فيها حديثة وممتعة، فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
      },
      {
        id: "rev-3",
        studentName: "محمد احمد الشيخ",
        avatar: reviewer1,
        accountType: "طالب",
        rating: 5,
        date: "2025/8/18",
        comment:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى التجربة التعليمية فيها حديثة وممتعة، فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
      },
    ],
  },
  {
    id: Math.random().toString(36).substr(2, 9),
    title: "كورس تصميم Ui UX للتطبيقات و المواقع الالكترونية.",
    description:
      "درس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام. يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة، مع تعريف الطالب بمبادئ التصميم الجيد وكيفية بناء تجربة بصرية مريحة وواضحة. يشمل الكورس تطبيقات عملية باستخدام أدوات احترافية مثل Figma وAdobe XD، ويتعلّم الطالب تصميم صفحات لتطبيقات الموبايل والمواقع بشكل احترافي. كما يتم شرح الأخطاء الشائعة في التصميم وكيفية تجنبها بأسلوب بسيط ومباشر. في نهاية الكورس، ينفّذ الطالب مشروع تصميم حقيقي ليضيفه إلى ملفه الشخصي (Portfolio)، ويحصل على تقييم وملاحظات تساعده على تحسين مستواه وتطوير مهاراته.",
    rating: 4.7,
    duration: "28 ساعة",
    studentsCount: 17000,
    img: image3, // تأكد من استيراد المتغير image1

    // 1. المميزات (Features)
    features: [
      { id: 1, text: "+ 170 طالبًا مشاركًا." },
      { id: 2, text: "شهادة بعد الانتهاء من الدورة." },
      { id: 3, text: "اختبارات بعد الانتهاء من كل درس." },
    ],
    // 2. قائمة الوحدات (Chapters)
    chapters: [
      {
        id: "ch1",
        title: "الوحدة الأولى : مقدمة في قواعد البيانات",
        description:
          "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام.يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ ",
      },
      {
        id: "ch2",
        title: "الوحدة الثانية : مقدمة في UI / UX",
        description:
          "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام.يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ ",
      },
      {
        id: "ch3",
        title: "الوحدة الثانية : مقدمة في UI / UX",
        description:
          "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام.يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ ",
      },
    ],

    // 3. مدربي الدورة (Instructors)
    instructors: [
      {
        id: "inst-1",
        name: "خليل شركة تيكنوفا",
        avatar: instructor1,
        coursesCount: 24,
        bio: "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام. يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ التصميم الجيد وكيفية بناء تجربة بصرية مريحة وواضحة.يشمل الكورس تطبيقات عملية باستخدام أدوات احترافية مثل Figma وAdobe ",
      },
      {
        id: "inst-2",
        name: "خليل شركة تيكنوفا",
        avatar: instructor2,
        coursesCount: 24,
        bio: "ورس تصميم واجهات المستخدم (UI Design) هو رحلة متكاملة لتعلّم كيفية تحويل الأفكار إلى تصاميم جذابة وسهلة الاستخدام. يبدأ بشرح أساسيات التصميم، الألوان، الخطوط، وتناسق العناصر على الشاشة.تعرّف الطالب على مبادئ التصميم الجيد وكيفية بناء تجربة بصرية مريحة وواضحة.يشمل الكورس تطبيقات عملية باستخدام أدوات احترافية مثل Figma وAdobe ",
      },
    ],

    // 4. تعليقات الطلاب (Reviews)
    reviews: [
      {
        id: "rev-1",
        studentName: "محمد احمد الشيخ",
        avatar: reviewer1,
        accountType: "طالب",
        rating: 5,
        date: "2025/8/18",
        comment:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى التجربة التعليمية فيها حديثة وممتعة، فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
      },
      {
        id: "rev-2",
        studentName: "محمد احمد الشيخ",
        avatar: reviewer1,
        accountType: "طالب",
        rating: 5,
        date: "2025/8/18",
        comment:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى التجربة التعليمية فيها حديثة وممتعة، فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
      },
      {
        id: "rev-3",
        studentName: "محمد احمد الشيخ",
        avatar: reviewer1,
        accountType: "طالب",
        rating: 5,
        date: "2025/8/18",
        comment:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى التجربة التعليمية فيها حديثة وممتعة، فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
      },
    ],
  },
];
