// src/data.js
import { images } from "./assets/images";
export const testimonials = [
  {
    id: 1,
    name: "محمد أحمد الشيخ",
    role: "طالب",
    date: "24 أيار 2025",
    avatar: process.env.PUBLIC_URL + "/Ellipse-1245.png", // رابط صورة الطالب
    content:
      "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
    period: "منذ يومين",
    replies: [
      {
        id: 1,
        name: "محمد أحمد الشيخ",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245.png", // رابط صورة الطالب
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",

        period: "منذ يومين",
      },
    ], // هنا نضع الردود
  },
  {
    id: 2,
    name: "خليل أحمد",
    role: "طالب",
    date: "24 أيار 2025",
    avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png", // رابط صورة الطالب
    content:
      "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
    period: "منذ يومين",
    replies: [
      {
        id: 1,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 2,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 3,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 4,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 5,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 6,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 7,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 8,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 9,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 10,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 11,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 12,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 13,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 14,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
    ], // هنا نضع الردود
  },
  {
    id: 3,
    name: "خليل أحمد",
    role: "طالب",
    date: "24 أيار 2025",
    avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
    content:
      "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
    period: "منذ يومين",
    replies: [
      {
        id: 1,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 2,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 3,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 4,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 5,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 6,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 7,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 8,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 9,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 10,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 11,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 12,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 13,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
      {
        id: 14,
        name: "خليل أحمد",
        role: "طالب",
        date: "24 أيار 2025",
        avatar: process.env.PUBLIC_URL + "/Ellipse-1245(1).png",
        content:
          "منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى. التجربة التعليمية فيها حديثة وممتعة. فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.",
        period: "منذ يومين",
      },
    ], // هنا نضع الردود
  },
];

export const contentcomment = `منصة رائعة، سهلت علي متابعة الدروس والوصول للمحتوى \n
 "التجربة التعليمية فيها حديثة وممتعة، فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا. "التجربة التعليمية فيها حديثة وممتعة، فعلاً خطوة كبيرة نحو تعليم أفضل في سوريا.`;
