// import { images } from "./assets/images";
export const homeData = [
  {
    id: 1,
    title: "منشور تصميم  Ui UX للتطبيقات و المواقع الالكترونية.",
    desc: "لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .",
    date: "20 اكتوبر / 2025",
    auth: "محمد احمد الشيخ",
    authimage: process.env.PUBLIC_URL + "/auth-image.jpg",
    comment: "+100 تعليق",
    period: " .24 دورة",
    image:
      process.env.PUBLIC_URL +
      "/young-man-sitting-restaurant-explaining-strategy-his-friends-1-(1).png",
  },
  {
    id: 2,
    title: "منشور تصميم  Ui UX للتطبيقات و المواقع الالكترونية.",
    desc: "لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .",
    date: "30 اكتوبر / 2025",
    auth: "محمد احمد الشيخ",
    authimage: process.env.PUBLIC_URL + "/auth-image.jpg",
    comment: "+100 تعليق",
    period: " .24 دورة",
    image:
      process.env.PUBLIC_URL +
      "/two-friends-studying-library-using-their-laptops-1.png",
  },
];
export const content = `لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .

لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .
لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين 

لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .

لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .سب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .

لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .`;
export const projectData = [
  {
    id: 1,
    title: "منشور تصميم  Ui UX للتطبيقات و المواقع الالكترونية.",
    desc: "لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .",
    date: "2025 / 8 / 18",
    auth: " 22 متطوع حالي بالمشروع ",
    // authimage: process.env.PUBLIC_URL + "/auth-image.jpg",
    comment: "لم يكمتل العدد",
    image: process.env.PUBLIC_URL + "/project1.png",
    volunteers: [
      { image: process.env.PUBLIC_URL + "/v1.jpg" },
      { image: process.env.PUBLIC_URL + "/v2.jpg" },
      { image: process.env.PUBLIC_URL + "/v3.jpg" },
    ],
  },
  {
    id: 2,
    title: "منشور تصميم  Ui UX للتطبيقات و المواقع الالكترونية.",
    desc: "لقد قمنا بتحسين المحتوى الذي يناسب جمهورك، لقد قمنا بتجميع قائمة من الاخبار .",
    date: "2025 / 8 / 18",
    auth: " 22 متطوع حالي بالمشروع ",
    // authimage: process.env.PUBLIC_URL + "/auth-image.jpg",
    comment: "ممتلئ",
    image: process.env.PUBLIC_URL + "/project2.png",
    volunteers: [
      { image: process.env.PUBLIC_URL + "/v1.jpg" },
      { image: process.env.PUBLIC_URL + "/v2.jpg" },
      { image: process.env.PUBLIC_URL + "/v3.jpg" },
    ],
  },
];
